src/test/java/resources/YVDRequest40DRY1Equipment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://services.apmoller.net/ManagementFramework/CommonIdentifier/v2" xmlns:v4="http://services.apmoller.net/AMM/v4">
   <soapenv:Header xmlns:v1="http://services.apmoller.net/DB-IPT-R/v1">
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>int_slt_utm_user</wsse:Username>
            <wsse:Password>weblogic1</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
      <ns1:CommonIdentifierRequest xmlns:ns1="http://services.apmoller.net/ManagementFramework/CommonIdentifier/v2">
         <ns1:ApplicationRequester>
            <ns1:ApplicationID>SSIB</ns1:ApplicationID>
            <ns1:ChannelID>Osb</ns1:ChannelID>
            <ns1:OperatorID>MSL</ns1:OperatorID>
            <!--Needed for UTM-->
            <ns1:TransactionID>BALCC0303</ns1:TransactionID>
         </ns1:ApplicationRequester>
         <ns1:UserRequester/>
      </ns1:CommonIdentifierRequest>
   </soapenv:Header>
   <soapenv:Body>
      <AMM:ValidateShipmentOnYieldRequest xsi:schemaLocation="http://services.apmoller.net/AMM/v4 YieldManagementV1.xsd" xmlns:AMM="http://services.apmoller.net/AMM/v4" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <AMM:ShipmentRequest>
            <AMM:ClientReference>EntityId="BALCC0303",ProfileId="",RequestId="RIDRK3BNPD3LZ9KB",SequenceNumber="",SequenceTime="2018-07-13 13.14.08.261271",ServiceName="",SubEntityId="",UserId=""</AMM:ClientReference>
            <AMM:IsOriginalShipment>false</AMM:IsOriginalShipment>
            <AMM:Journey>
               <AMM:CardinalDirection>
                  <AMM:CardinalDirectionCd>R</AMM:CardinalDirectionCd>
               </AMM:CardinalDirection>
               <AMM:JourneyGroup>
                  <AMM:JourneyGroupCd>F4</AMM:JourneyGroupCd>
               </AMM:JourneyGroup>
            </AMM:Journey>
            <AMM:ShipmentPriceCalculationDttm>2018-09-18T00:00:00</AMM:ShipmentPriceCalculationDttm>
            <AMM:Shipment>
               <AMM:Cargo>
                  <AMM:IsReefer>false</AMM:IsReefer>
               </AMM:Cargo>
               <AMM:DeliveryReceiptModeCombination>
                  <AMM:ReceiptDeliveryCode>CY/CY</AMM:ReceiptDeliveryCode>
               </AMM:DeliveryReceiptModeCombination>
               <AMM:IsConferencePriced>false</AMM:IsConferencePriced>
               <AMM:Operator>
                  <AMM:OperatorCode>
                     <AMM:AlternativeCodeVal>MSL</AMM:AlternativeCodeVal>
                  </AMM:OperatorCode>
               </AMM:Operator>
               <AMM:ServiceContract>
                  <AMM:ServiceContractNumber>3423883</AMM:ServiceContractNumber>
               </AMM:ServiceContract>
               
              
               <AMM:ShipmentEquipmentAssignment>
                  <AMM:Container>
                     <AMM:ContainerProfile>
                        <AMM:ContainerSize>
                           <AMM:ContainerSizeCd>40</AMM:ContainerSizeCd>
                        </AMM:ContainerSize>
                        <AMM:ContainerType>
                           <AMM:ContainerTypeCd>DRY</AMM:ContainerTypeCd>
                        </AMM:ContainerType>
                        <AMM:ISOContainerSizeType>
                           <AMM:ISOContainerHeight>
                              <AMM:ISOContainerHeightCd>8 6</AMM:ISOContainerHeightCd>
                           </AMM:ISOContainerHeight>
                        </AMM:ISOContainerSizeType>
                     </AMM:ContainerProfile>
                     <AMM:ISOSerialNum>2TKSWLB3LZ8KE</AMM:ISOSerialNum>
                  </AMM:Container>
                  <AMM:EquipmentStuffingPlan>
                     <AMM:Cargo>
                        <AMM:CargoId>2CCQWLB3LZ8KE</AMM:CargoId>
                        <AMM:CommodityClassificationTreatment>
                           <AMM:CommodityClassification>
                              <AMM:CommodityClassificationCd>004105</AMM:CommodityClassificationCd>
                           </AMM:CommodityClassification>
                        </AMM:CommodityClassificationTreatment>
                        <AMM:ShipmentPrice>
                           <AMM:ProratePct>100.0</AMM:ProratePct>
                        </AMM:ShipmentPrice>
                     </AMM:Cargo>
                     <AMM:Measure>0</AMM:Measure>
                     <AMM:MeasureUnitOfMeasurement>
                        <AMM:UnitOfMeasurementAbbreviationVal>6</AMM:UnitOfMeasurementAbbreviationVal>
                     </AMM:MeasureUnitOfMeasurement>
                     <AMM:PackageCount>0</AMM:PackageCount>
                     <AMM:Weight>10000</AMM:Weight>
                     <AMM:WeightUnitOfMeasurement>
                        <AMM:UnitOfMeasurementAbbreviationVal>1</AMM:UnitOfMeasurementAbbreviationVal>
                     </AMM:WeightUnitOfMeasurement>
                  </AMM:EquipmentStuffingPlan>
                  <AMM:IsOutOfGauge>false</AMM:IsOutOfGauge>
                  <AMM:IsShipperOwned>false</AMM:IsShipperOwned>
                  <AMM:BookedWeight>10000</AMM:BookedWeight>
                  <AMM:BookedWeightUnitOfMeasurement>
                     <AMM:UnitOfMeasurementAbbreviationVal>1</AMM:UnitOfMeasurementAbbreviationVal>
                  </AMM:BookedWeightUnitOfMeasurement>
               </AMM:ShipmentEquipmentAssignment>
                            
               <AMM:ShipmentId>BALCC0303</AMM:ShipmentId>
               <AMM:ShipmentPartyRoles>
                  <AMM:BookedByCustomer>
                     <AMM:ShipmentPartyRole>
                        <AMM:PartyRole>
                           <AMM:CustomerCode>
                              <AMM:AlternativeCodeVal>11302959</AMM:AlternativeCodeVal>
                           </AMM:CustomerCode>
                        </AMM:PartyRole>
                     </AMM:ShipmentPartyRole>
                  </AMM:BookedByCustomer>
                  <AMM:ContractualCustomer>
                     <AMM:ShipmentPartyRole>
                        <AMM:PartyRole>
                           <AMM:CustomerCode>
                              <AMM:AlternativeCodeVal>11302959</AMM:AlternativeCodeVal>
                           </AMM:CustomerCode>
                        </AMM:PartyRole>
                     </AMM:ShipmentPartyRole>
                  </AMM:ContractualCustomer>
                  <AMM:PriceOwner>
                     <AMM:ShipmentPartyRole>
                        <AMM:PartyRole>
                           <AMM:CustomerCode>
                              <AMM:AlternativeCodeVal>11302959</AMM:AlternativeCodeVal>
                           </AMM:CustomerCode>
                        </AMM:PartyRole>
                     </AMM:ShipmentPartyRole>
                  </AMM:PriceOwner>
               </AMM:ShipmentPartyRoles>
               <AMM:ShipmentRoute>
                  <AMM:ShipmentRouteLink>
                     <AMM:Arrival>
                        <AMM:Vessel>
                           <AMM:Service>
                              <AMM:ServiceCd>404</AMM:ServiceCd>
                           </AMM:Service>
                           <AMM:VesselCode>
                              <AMM:AlternativeCodeVal>8HF</AMM:AlternativeCodeVal>
                           </AMM:VesselCode>
                        </AMM:Vessel>
                        <AMM:VoyageCd>1810</AMM:VoyageCd>
                     </AMM:Arrival>
                     <AMM:ETD>2018-09-18T00:00:00</AMM:ETD>
                     <AMM:End>
                        <AMM:Site>
                           <AMM:SiteCode>
                              <AMM:AlternativeCodeVal>EGDAMPT</AMM:AlternativeCodeVal>
                           </AMM:SiteCode>
                        </AMM:Site>
                     </AMM:End>
                     <AMM:JourneyLeg>
                        <AMM:JourneyLegId>1722597</AMM:JourneyLegId>
                        <AMM:RoutingType>
                           <AMM:RoutingTypeCd>M</AMM:RoutingTypeCd>
                        </AMM:RoutingType>
                        <AMM:TransitTime>29160</AMM:TransitTime>
                     </AMM:JourneyLeg>
                     <AMM:LayoverTime>0</AMM:LayoverTime>
                     <AMM:Start>
                        <AMM:Site>
                           <AMM:SiteCode>
                              <AMM:AlternativeCodeVal>INJHTGT</AMM:AlternativeCodeVal>
                           </AMM:SiteCode>
                        </AMM:Site>
                     </AMM:Start>
                     <AMM:TransportMode>
                        <AMM:TransportModeCd>MVS</AMM:TransportModeCd>
                        <AMM:WaterLandMode>W</AMM:WaterLandMode>
                     </AMM:TransportMode>
                  </AMM:ShipmentRouteLink>
                  <AMM:ShipmentRouteRole>
                     <AMM:RouteRoleType>
                        <AMM:RouteRoleTypeCd>O</AMM:RouteRoleTypeCd>
                     </AMM:RouteRoleType>
                  </AMM:ShipmentRouteRole>
               </AMM:ShipmentRoute>
               <AMM:ShipmentRoute>
                  <AMM:ShipmentRouteLink>
                     <AMM:Arrival>
                        <AMM:Vessel>
                           <AMM:Service>
                              <AMM:ServiceCd>404</AMM:ServiceCd>
                           </AMM:Service>
                           <AMM:VesselCode>
                              <AMM:AlternativeCodeVal>8HF</AMM:AlternativeCodeVal>
                           </AMM:VesselCode>
                        </AMM:Vessel>
                        <AMM:VoyageCd>1810</AMM:VoyageCd>
                     </AMM:Arrival>
                     <AMM:ETD>2018-09-18T00:00:00</AMM:ETD>
                     <AMM:End>
                        <AMM:Site>
                           <AMM:SiteCode>
                              <AMM:AlternativeCodeVal>EGDAMPT</AMM:AlternativeCodeVal>
                           </AMM:SiteCode>
                        </AMM:Site>
                     </AMM:End>
                     <AMM:JourneyLeg>
                        <AMM:JourneyLegId>1722597</AMM:JourneyLegId>
                        <AMM:RoutingType>
                           <AMM:RoutingTypeCd>M</AMM:RoutingTypeCd>
                        </AMM:RoutingType>
                        <AMM:TransitTime>29160</AMM:TransitTime>
                     </AMM:JourneyLeg>
                     <AMM:LayoverTime>0</AMM:LayoverTime>
                     <AMM:Start>
                        <AMM:Site>
                           <AMM:SiteCode>
                              <AMM:AlternativeCodeVal>INJHTGT</AMM:AlternativeCodeVal>
                           </AMM:SiteCode>
                        </AMM:Site>
                     </AMM:Start>
                     <AMM:TransportMode>
                        <AMM:TransportModeCd>MVS</AMM:TransportModeCd>
                        <AMM:WaterLandMode>W</AMM:WaterLandMode>
                     </AMM:TransportMode>
                  </AMM:ShipmentRouteLink>
                  <AMM:ShipmentRouteRole>
                     <AMM:RouteRoleType>
                        <AMM:RouteRoleTypeCd>P</AMM:RouteRoleTypeCd>
                     </AMM:RouteRoleType>
                  </AMM:ShipmentRouteRole>
               </AMM:ShipmentRoute>
               <AMM:ShipmentStatus>
                  <AMM:ShipmentStatusCd>Active</AMM:ShipmentStatusCd>
               </AMM:ShipmentStatus>
               <AMM:ShipmentConfirmed>NA</AMM:ShipmentConfirmed>
               <AMM:IsMilitary>false</AMM:IsMilitary>
               <AMM:PricedByAFLS>true</AMM:PricedByAFLS>
            </AMM:Shipment>
         </AMM:ShipmentRequest>
         <!--AMM:RequestParameterList>
            <AMM:RequestParameter>
               <AMM:Name>REQUEST_CONTEXT</AMM:Name>
               <AMM:Value>BOOKING_ENQUIRY</AMM:Value>
            </AMM:RequestParameter>
         </AMM:RequestParameterList-->
      </AMM:ValidateShipmentOnYieldRequest>
   </soapenv:Body>
</soapenv:Envelope>